GetDesignSection
Syntax
SapObject.SapModel.DesignConcrete.GetDesignSection
VB6 Procedure
Function GetDesignSection(ByVal Name As String, ByRef PropName As String) As Long
Parameters
Name
The name of a frame object with a concrete frame design procedure.
PropName
The name of the design section for the specified frame object.
Remarks
This function retrieves the design section for a specified concrete frame object.
The function returns zero if the section is successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetConcreteDesignSection()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim PropName As String
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create new concrete frame section property
 ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288, True, "R1", "R1")
 'run analysis
 ret = SapModel.File.Save("C:\SapAPI\x.sdb")
 ret = SapModel.Analyze.RunAnalysis
 'start concrete design
 ret = SapModel.DesignConcrete.StartDesign
 'get design section
 ret = SapModel.DesignConcrete.GetDesignSection("8", PropName)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.03.
See Also
SetDesignSection